Revit 2027 API
ParameterTypeId.RasterLockProportions Property
 "Lock Proportions"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RasterLockProportions { get; }
Public Shared ReadOnly Property RasterLockProportions As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RasterLockProportions {
	ForgeTypeId^ get ();
}
static member RasterLockProportions : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace